export const PHCS_BOSSES = [
	"ICR",
	"ICM",
	"MSC",
	"FSK",
	"JTM",
	"WDG",
	"PTM",
	"DOL",
	"HST",
	"WRT"
];

const hallu_temp = [
	{
		name: "迷茫",
		key: "迷茫",
		effects: [],
		tooltip: {
			en: "",
			jp: "",
			cn: "本层的地图扩大了。路途在向着四面八方延伸，你觉得自己无法选择正确的道路。本层横向额外生成2个节点，纵向最多可同时出现4个分支。※不会在第Ⅵ层 渴欲大厅生效，而是会替换成幻觉：盲目",
		},
	},
	{
		name: "盲目",
		key: "盲目",
		effects: [],
		tooltip: {
			en: "",
			jp: "",
			cn: "本层中无法看到下一步行动以后的节点类型。即使事物就在眼前，你仍觉得它一片模糊。本层除下一步的节点外的所有节点的图案全部替换为UNKNOWN FOG，且均无法点击查看信息。基于这一幻觉特性，本层战斗节点结算后必定不会出现剧目。",
		},
	},
	{
		name: "暴怒",
		key: "暴怒",
		effects: [],
		tooltip: {
			en: "",
			jp: "",
			cn: "作战会在本层中更频繁地出现。所有人都是敌人，你渴望撕碎敌人！",
		},
	},
	{
		name: "孤独",
		key: "孤独",
		effects: [],
		tooltip: {
			en: "",
			jp: "",
			cn: "在本层招募时所需希望增加，但进阶时所需希望减少。你害怕失去，你想要不惜代价留住一切。在本层招募四星以上干员时希望消耗+1，进阶干员时希望消耗-1。",
		},
	},
	{
		name: "偏执",
		key: "偏执",
		effects: [],
		tooltip: {
			en: "",
			jp: "",
			cn: "本层中每一步行动都能获得额外源石锭，但离开时无法带走任何在本层获得的源石锭。额外的财富让你欣喜若狂，而失去它的恐惧也如影随形。在本层每前进1节点额外获得1源石锭，离开该层后最多保留相当于进入本层时源石锭的数量。",
		},
	},
	{
		name: "谨慎",
		key: "谨慎",
		effects: [],
		tooltip: {
			en: "",
			jp: "",
			cn: "本层中可同时部署人数减少，但可携带干员增加。你邀请了许多人同行，却在部署时小心翼翼。在本层可同时部署人数-1，可携带干员+1。",
		},
	},
];
